export class CaptchaConsts {
    public static WRONG_ANSWER_MESSAGES = [
        "טעות! נסו שוב",
        "תשובה לא נכונה! הזהרו מוחמד ג'מאלוור עלול לחשוב שאתם ציונים",
        "טעות! מוחמד ג'מאלוור חושד שאתם ציונים",
        "מה זאת התשובה הזאת? נראה כמו טעות שרק ציוני היה עושה",
        "בוזזזז",
        "תשובה שגויה! משטרת הציונות שמה עליכם עין - הזהרו",
        "התשובה שהזמנתם אינה נכונה, מוחמד ג'מאלוור משגיח בקפידה על מסמכיו הסודיים אך מוכן לתת לכם הזדמנות נוספת"
    ]

    public static CORRECT_ANSWER_MESSAGE = [
        "מוחמד ג'מאלוור עדיין לא משוכנע שאינכם ציוניים, אנא המשיכו למבחן הציונות הבא",
        "יש לכם ניחוח ציוני, תצטרכו להמשיך במבחן הציונות כדי להוכיח שאינכם ציוניים",
        "מוחמד ג'מאלוור גילה שיש ציונים שמנסים לפרוץ למסמכיו המסווגים ולכן הגביר את האבטחה עליהם, המשיכו לשאלה למבחן הבא",
        "תשובה נכונה! אבל עדיין לא הוכחתם שאינכם ציוניים",
        "כל הכבוד! אבל עדיין לא הצלחתם לשכנע את מוחמד ג'מאלוור שאתם לא ציוניים",
        "המסמכים הבאים מסווגים ביותר, אנא המשיכו בתהליך ההזדהות מרובה השלבים",
        "רק עוד קצת",
        "ממש עוד טיפה",
        "אתם קרובים לסוף, לא להכנע, רק ציונים נכנעים",
        "מבחן הציונות מרובה שלבים, אנא המשיכו לשלב הבא בכדי להוכיח שאכן אינכם ציונים",
        "הציונים מאוד חכמים ולכן מוחמד ג'מאלוור החליט להוסיף עוד כמה שלבים למבחן הציונות הגדול כדי לוודא שהם לא עוברים אותו"
    ]

    public static FINISHED_MAZE = "כל הכבוד! הוכחתם שאינכם ציוניים! עכשיו תוכלו לגשת למסמכים המסווגים של מוחמד ג'מאלוור"
}